window.onload = function() {
  init();
};
const pages = {
  buying_in_web:
    "Як безпечно купити авто в інтернеті? Очевидно, що конкретної відповіді на це питання не існує, а втішний результат залежить від дотримання певних рекомендацій з пошуку, переговорами з власниками, підготовки документів. Давайте розбиратись детальніше як придбати авто в інтернеті та не втратити кошти. Спочатку, треба знайти надійну платформу для купівлі авто. Зазвичай, такі платформи з’являються перші в пошуку, тому будьте уважні, якщо шукаєте не на першій сторінці. Найвідоміші сайти в Україні: autoria rikauto rst Друга складова успіху – це підбір фільтрів авто. Звертайте увагу на середні ціни обраної марки, які можна отримати у нас на сайті . Слідкуйте, щоб характеристики машини були правильними та несуперечливими, наприклад: Машина із лобовою проекцією не може мати обігрів скла Рік випуску авто та її деталей Співвідношення двигуна до кінських сил, потужності, розгону Особливу увагу треба приділяти коробці передач та двигуну, бо ці деталі найчастіше замінюються на не оригінальні, що може призвести до поломки. Звичайно, що без розмови з власником неможливо купити авто. Прогляньте профіль цієї людини. За наявністю наступних пунктів ймовірність, що це шахрай зростає: Пустий профіль Нещодавня дата реєстрації Негативні відгуки Забагато відгуків взагалі (є шанс, що це боти) Отже, покупка авто – складна річ із безліччю підводних каменів. Треба бути уважним до усіх дрібниць від опису авто на сайті до розмови та огляду авто особисто. Для тренування потрібен час, тому не поспішайте покупати першу машину, яка вам сподобалась. Краще зробіть повний цикл вибору авто декілька разів, що запам’ятати всі зазначені правила та зробити свої власні. Нехай вам щастить!",
  buying_used:
    "Купiвля Б/У авто При купівлі нової автівки, вибір найчастіше зупиняється на авто, котрі вже буди у використранні, особливо, якщо ця автівка у вас перша. З кожним наступним власником авто виникають нові нюанси, котрі потрібно вразовувати під час купівлі: Рівень пошкодженості Чи була втоплена Чи була бита Кілометраж Законність Пошкодженість Майже усі машини, котрі знаходилися у користуванні потрапляли у ДТП. Були то звичайні подряпини, або повномаштабне зіткнення, що призвело до повної заміни деяких частин автівки може вплинути на її працездатність та зовнішній вигляд з часом. Тому потрібно ретельно перевіряти авто під час огляду. Наші поради: Придбайте, або орендуйте товщиномер перед оглядом авто. Зверніться до експерта Звертайте увагу на фарбу та її відтінки на гайках, це може показати, чи рідна деталь, чи ні. Рік випуску деталей має бути однаковим Звертайте увагу на рекцію власника під час відповіді на питання про биття. Ризики ламаної машини В ідеалі не купляти ламану машину, але ви можете значно заощадити на купівлі такої машини, а отже цим фактором часто незтують. Але це може призвести до наступних проблем: Поява тріщин на вікнах, через викривлену геометрію деталей навколо них Неоднаковий знос на шинах з різних боків Витік повітря з салону або в салон До кого звертатися по допомогу? Експертна оцінка авто хоч і може коштувати як сам авто, але в більшості випадків, особливо при перших досвідах купівлі в невідомих людей вона того варта, і збереже вам не лише гроші, а й нерви та вбереже вас від потенційних небезпечних ситуацій на дорозі. nise.com.ua avtocod avtoexpertiza Отже Підводячи підсумки можна сказати, що не варто витрачати більше потрібного, але і скупитися також не можна, бо це може призвести до несподіваних наслідків. Отже перевіряйте двічі, робіть попередні дослідження по темі та не цурайтеся звернутися по допомогу. Та водіть безпечно і не пийте за кермомо нової машини. Гуд бай ;)",
  index:
    "Оцінка б/у авто Принцип роботи калькулятора Ми обрахуваємо ціну вашого авто абсолютно автоматично. Це означає, що людина ніяким чином не може вплинути на результат формування ціни. Було зібрано та проаналізовано десятки тисяч успішних угод на платформах продажу б/у авто. А кінцеве рішення здійснюється завдяки передовим технологіям штучного інтелекту. Переваги автоматизованого оцінювання Для отримання оптимальної оцінки зазвичай потрібно аналізувати ринок, шукати схожі авто на різних платформах. Використовуючи наш калькулятор, ви отримуєте актуальну оцінку вартості авто, аналізуючи дані багатьох оголошень, перевірених експертами. Також вам не потрібно залучати третіх осіб, відповідно витрачати на це час та гроші. Перелік параметрів б/у авто Модель авто (Megane , Focus , Camry) Пробіг (кількість кілометрів) Бренд авто (Volkswagen, Renault, Mercedes-Benz) Об'єм двигуна (кількість літрів) Тип кузова (Седан, Универсал, Внедорожник) Рік випуску Колір Тип палива (Дизель, Бензин , Газ) Коробка передач (Ручная / Механика, Автомат) Дані параметри впорядковані згідно з їх впливом на формування ціни. Від найбільшого до найменшого.",
  new:
    "Оцінка нового авто Принцип роботи калькулятора Ми обрахуваємо ціну вашого авто абсолютно автоматично. Це означає, що людина ніяким чином не може вплинути на результат формування ціни. Було зібрано та проаналізовано десятки тисяч успішних угод на платформах продажу б/у авто. А кінцеве рішення здійснюється завдяки передовим технологіям штучного інтелекту. Переваги автоматизованого оцінювання Для отримання оптимальної оцінки зазвичай потрібно аналізувати ринок, шукати схожі авто на різних платформах. Використовуючи наш калькулятор, ви отримуєте актуальну оцінку вартості авто, аналізуючи дані багатьох оголошень, перевірених експертами. Також вам не потрібно залучати третіх осіб, відповідно витрачати на це час та гроші. Перелік параметрів нового авто З даним переліком можна ознайомитися на (лінк на Оцінка б/у авто). При оцінці нового авто значення поля «пробіг» має бути нулем.",
  prepare_to_sell:
    "Підготовка авто до продажу Ви вирішили продати своє авто і маєте сумніви з чого краще почати? Не проблема! Нижче ми розповімо, які кроки потрібно виконати, щоб передати вашого “скакуна” за тією ціною, на яку він заслуговує:) Виділимо 4 підготовчих етапи: Зовнішній вигляд Технічний стан Документація Оцінка авто та вибір майданчику для продажу Зовнішній вигляд Водні процедури Перш ніж віддавати автомобіль у мийку або виконувати цей процес самому, зверніть увагу на ряд дрібних деталей: будь-які наявні молдінги повинні бути рівні, оскільки під ними можуть ховатися пошкодження. усі накладні деталі повинні бути надійно прикріплені. якщо є подряпини, варто їх зафарбувати відповідним кольором авто від незначних подряпин та для оновлення лакофарбового покриття допоможе полірування кузова. якщо у фарах чи ліхтарях присутня волога - розберіть та протріть їх із середини. Якщо ви вирішили скористатися послугами автомийки, то обов’язково перевірте, щоб був вимитий підколесний простір. Чистка салону Перше, що може відштовхнути людину від покупки авто — це запах салону. Якщо вам здається, що всередині і так приємно пахне, то ви можете помилятися. Оскільки ви звикли до цих запахів, то можете не помітити проблем. Тому переконайтеся у виконанні наступних пунктів: використати нейтральний ароматизатор якщо ви палите, то варто хоча б за місяць перестати це робити в салоні, щоб вивести запах. протерти від пилу решітки кондиціонера бажано замінити салонний фільтр Далі, переконайтеся, що всі дрібні деталі знаходяться на своїх місцях і вся електроніка (звук, підсвітка) знаходиться у робочому стані. Також варто зробити хімчистку салону, а якщо вважаєте, що впораєтеся самі, то зробіть наступне: ретельно пропилососьте всередині вимийте скло із середини натріть пластик матовим поліролем для природнього вигляду очистіть стелю від плям Технічний стан “По одежі стрічають, а по уму випроводжають” — це не лише про людей, а й автомобілі. Саме стан внутрішніх компонентів впливає на придатність транспортного засобу до їзди та кінцеве рішення покупця. Якщо є бажання або хочеться заощадити кошти на послугах сервісного центру, то наступні рекомендації можна виконати самостійно: Відмити двигун. Без попереднього досвіду не варто робити парову чистку, оскільки є ризик пошкодження підкапотних частин за недотримання технологічних норм. Відмити розводи від витратних рідин та сліди на бачку омивача. За необхідності зробити заміну свічок запалювання, хомутів та переліжок кришок. Наповнити рідиною усі бачки та проконтролювати колір та рівень двигунного масла. Перевірити справність гальмів та зокрема відрегулювати ручник. Замінити перегорілі індикатори та лампочки фар Також варто залити преміум бензин, що збереже двигун і дозволить йому працювати стабільніше. Не буде підготувати книгу авто із історією його обслуговування та пошкоджень. Це допоможе завчасно ознайомити потенційного покупця із усіма можливими проблемами. Підготовка документації На цьому етапі, ви вже привели ваше авто до товарного вигляду і тепер можна починати збирати документи для забезпечення законності продажу. Повний перелік необхідних документів: Паспорт та ідентифікаційний код продавця Паспорт та ідентифікаційний код покупця Технічний паспорт автомобіля За наявності документи про право власності (нотаріальні угоди, дарча, купівля-продаж і т.д) Заява на перереєстрацію — можна оформити в центрі МВС Оцінка вартості транспортного засобу — потрібна за необхідності сплати податків Оцінка вартості авто Після виконання попередніх кроків ви можете тепер із задоволенням почати рахувати майбутні золоті злитки :) Залежно від терміновості, ви можете запросити більшу або меншу ціну від об’єктивної вартості. Проте, для цього потрібно знати від чого відштовхуватися. Саме тому ми спростили цей процес і зробили це за вас. Калькулятор вартості авто[гіперлінк на сторінку з калькулятором] допоможе вам менш, ніж за секунду отримати точну вартість вашої “ластівки”! На останок, прямуйте на будь-який перевірений маркетплейс і розміщуйте оголошення про продаж. Як безпечно та надійно це зробити, дізнайтеся у нашій статті[гіперлінк на статтю з безпечним продажем].",
  price_up_used:
    "Як підвищити ціну свого б/у авто? Зазвичай найкращим способом оцінити вартість бу авто є дослідити ринок, та знайти схожі авто на ресурсах, описаних у статті 'Як безпечно купити авто в інтернеті', або ж скористатися нашим розумним калькулятором, і за мілісекунди отримати оптимальну оцінку авто. Але зважайте, що на ціну також може впливати зовнішній вигляд та внутрішній стан авто. Для підвищення ціни б/у авто потрібно загалом є наступні поради: Гарний зовнішній вид. Тріснуте скло замінюємо на дешеве, китайського виробництва, тріснутий або розколотий пластик бамперів робимо в спеціалізованому автосервісі (найпопулярніші згідно шукачів - boschcarservice auto-spec ). Після цього їдемо на полірування кузова. Можна, звичайно, і самому постаратися, але без практики результат може розчарувати. І не забуваємо про диски! Побиті і обгризені корозією, вони будуть псувати весь вигляд. Тому має сенс відправити їх на шліфування і фарбування. Сумарні витрати на такі роботи навряд чи заберуть кілька сотень $, проте допоможуть потім виручити до тисячі зайвих $. Також рекомендується провести хімчистку салону та багажнику. Немає сенсу намагатися змінити цифру на одометрі, адже покупець з легкістю може звернутися до офіційного СТО. Головні фактори вартості бу авто які було отримано аналізуючи дані з ресурсу autoria: На запитання «чи є сенс робити ремонт авто перед його продажем?» можна відповісти досить простою формулою: розпитайте в декількох автосалонах вартість ремонту вашого авто, розрахуйте середню вартість. Тепер цю суму додайте до нинішньої вартості «битого» авто і запитайте себе, чи стали ви б купувати автомобіль в такому стані за таку ціну? Якщо ні, то продавайте у такому стані."
};
function init() {
  var data = JSON.parse(
    `{"transmission": ["Ручная / Механика", "Автомат", "Типтроник", "Адаптивная", "Вариатор"],"color": ["Красный", "Черный", "Белый", "Синий", "Бежевый", "Серый", "Коричневый", "Фиолетовый", "Зеленый", "Желтый", "Оранжевый"], "fuel_type": ["Газ/бензин", "Дизель", "Бензин", "Газ", "Электро", "Газ метан", "Гибрид", "Другое", "Газ пропан-бутан"]}`
  );
  // const data = JSON
  Object.keys(data).forEach(value => {
    insertOptions(value, data[value]);
  });
  const options_url = "http://34.90.123.230:8081/app/v1/data";
  // fetch(no_cors(options_url))
  //   .then(raw => raw.json())
  //   .then(res =>
  //     Object.keys(res).forEach(value => {
  //       console.log(value, res[value]);

  //       insertOptions(value, res[value]);
  //     })
  //   )
  //   .catch(console.error);
}
document
  .getElementById("search_form")
  .addEventListener("submit", e => e.preventDefault());
document
  .getElementById("search")
  .addEventListener("click", () => handle_autocomplete());

function handle_autocomplete() {
  document.getElementById("autocomplete").style.display = "block";
  const input = document.getElementById("input_field").value;
  const fitting_pages = search_for_words(input, pages);
  append_autocomplete(fitting_pages);
}

function no_cors(url) {
  const proxyurl = "https://cors-anywhere.herokuapp.com/";
  return proxyurl + url;
}

String.prototype.toUnicode = function() {
  var result = "";
  if (english.test(this)) return this.toString();
  if (isnumber.test(this)) return parseInt(this);
  if (!isNaN(parseFloat(this))) return parseFloat(this);
  for (var i = 0; i < this.length; i++) {
    // Assumption: all characters are < 0xffff
    result +=
      "\\" + "u" + ("000" + this[i].charCodeAt(0).toString(16)).substr(-4);
  }
  return result;
};
var english = /^[A-Za-z]*$/;
var isnumber = /^[0-9]*$/;

async function send() {
  var body = {};
  body["prod_date"] =
    document.getElementById("year").value.toUnicode() || "2002".toUnicode();
  body["country"] = document
    .getElementById("country")
    .value.toUnicode()
    .toUnicode();
  body["body_type"] =
    document.getElementById("type").value.toUnicode() || "Седан".toUnicode();
  body["brand_name"] =
    document.getElementById("brand").value.toUnicode() || "Toyota".toUnicode();
  body["mileage_value"] =
    document.getElementById("mileage").value.toUnicode() || 0;
  body["color"] =
    document.getElementById("color").value.toUnicode() || "Серый".toUnicode();
  body["with_auction"] = 0;
  body["with_exchange"] = 0;
  body["model"] =
    document.getElementById("model").value.toUnicode() || "corolla".toUnicode();
  body["engine_volume"] =
    document.getElementById("engine_volume").value.toUnicode() || 2;
  body["fuel_type"] =
    document.getElementById("fuel_type").value.toUnicode() ||
    "Дизель".toUnicode();
  body["transmission"] =
    document.getElementById("transmission").value.toUnicode() ||
    "Автомат".toUnicode();
  for (const key in body) {
    if (!body[key] && body[key] !== 0) {
      delete body[key];
    }
  }

  console.log(body);

  var features = JSON.stringify(body);

  const url = `http://34.90.123.230:8081/app/v1/predict?model=lgbm&features=${features}`;
  const raw = await fetch(no_cors(url));
  const res = await raw.json();
  const price = res["predicted_price"][0];
  document.getElementById("response").innerText = price.toFixed(2) + "$";
  window.scrollTo({
    top: 100,
    behavior: "smooth"
  });
}

function insertOptions(selectId, optionsArray) {
  var selectTag = document.getElementById(selectId);
  if (selectTag) {
    var optionTags = makeTags(optionsArray);
    optionTags.forEach(tag => {
      selectTag.innerHTML += tag;
    });
  }
}

function search_for_words(input, dictionary) {
  var resulting_keys = {};
  for (const key in dictionary) {
    const current_elem = dictionary[key];
    const input_index = current_elem.indexOf(input);
    if (input_index !== -1) {
      console.log(key);
      resulting_keys[key] =
        "..." +
        current_elem.substring(
          input_index - 25,
          input_index + input.length + 25
        ) +
        "...";
    }
  }
  return resulting_keys;
}

function append_autocomplete(fitting_pages) {
  var autocomplete_content = "<ul>";
  for (const key in fitting_pages) {
    autocomplete_content += `<li> <a href=${key}.html>${fitting_pages[key]}</a> </li>`;
  }
  autocomplete_content += "</ul>";

  document.getElementById("autocomplete").innerHTML = autocomplete_content;
}

function makeTags(optionsArray) {
  return optionsArray.map(
    option => `<option value=${option}>${option}</option>`
  );
}
